<a href="https://colab.research.google.com/github/chrishuskey/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/Assignment_Unit_1%2C_Sprint_1%2C_Module_3_Join_and_Reshape_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-10-03 02:51:59--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.168.21
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.168.21|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’

instacart_online_gr 100%[===================>] 196.03M  47.5MB/s    in 4.5s

2019-10-03 02:52:04 (43.2 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [4]:
# First, let's see what files we have from Instacart:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [5]:
import pandas as pd

# Next, let's see what variables (columns) each file has:
aisles = pd.read_csv('aisles.csv')
print(aisles.shape)
aisles.head()

(134, 2)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [6]:
departments = pd.read_csv('departments.csv')
print(departments.shape)
departments.head()

(21, 2)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [7]:
order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
order_products__prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [8]:
order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [9]:
orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [10]:
products = pd.read_csv('products.csv')
print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [11]:
# For this "Join Data Practice" problem, we need:
# (1)  order_id
# (2)  product id
# (3)  product name

# Makes a combined dataframe that includes all of the above, taken from:
# - order_id and product_id from [concatenate: order_products_prior CSV + 
# order_products_train CSV]
# - product_name from the products CSV

order_products_all = pd.concat([order_products__prior, order_products__train])
print(order_products_all.shape)
order_products_all.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
with_product_names = pd.merge(order_products_all, products[['product_id', 'product_name']], how='inner', on='product_id')

In [13]:
with_product_names.tail()

          order_id  ...                                       product_name
33819101   2269288  ...                  Non-Dairy Coconut Seven Layer Bar
33819102   2507248  ...                  Non-Dairy Coconut Seven Layer Bar
33819103   2271346  ...  Ultra Sun Blossom Liquid 90 loads Fabric Enhan...
33819104   3004244  ...                               Sweetart Jelly Beans
33819105   3376312  ...                            Water With Electrolytes

[5 rows x 5 columns]

In [14]:
with_product_names.isnull().sum()

order_id             0
product_id           0
add_to_cart_order    0
reordered            0
product_name         0
dtype: int64

In [15]:
# Find and print the # of orders that included each of the top 10 most 
# popular products (Note: this does not account for duplicate #'s of the same 
# product within the same order, only for # of orders including at least 1):
top_10_frequencies = with_product_names['product_name'].value_counts()[:10].to_frame(name='# of Orders Containing This Product')
print('The Top 10 Most-ordered Products in the Instacart Dataset, and How Many Orders Each Appeared In:')
top_10_frequencies

The Top 10 Most-ordered Products in the Instacart Dataset, and How Many Orders Each Appeared In:

                        # of Orders Containing This Product
Banana                                               491291
Bag of Organic Bananas                               394930
Organic Strawberries                                 275577
Organic Baby Spinach                                 251705
Organic Hass Avocado                                 220877
Organic Avocado                                      184224
Large Lemon                                          160792
Strawberries                                         149445
Limes                                                146660
Organic Whole Milk                                   142813

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2

In [0]:
import numpy as np
import pandas as pd
%matplotlib inline
import seaborn as sns

# Wickham's Table 1 from the article as a pandas dataframe:
table1 = pd.DataFrame([[np.nan, 2], 
                       [16, 11], 
                       [3, 1]], 
                      index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
                      columns=['treatmenta', 'treatmentb'])

table2 = table1.T

In [53]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [54]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [55]:
# Table 1 --> Tidy:
table1 = table1.reset_index()
tidy = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy = tidy.rename(columns={
    'index': 'name', 
    'variable': 'treatment', 
    'value': 'result'
})
tidy['treatment'] = tidy['treatment'].str.replace('treatment', '')
tidy

           name treatment  result
0    John Smith         a     NaN
1      Jane Doe         a    16.0
2  Mary Johnson         a     3.0
3    John Smith         b     2.0
4      Jane Doe         b    11.0
5  Mary Johnson         b     1.0

In [0]:
# # Table 2 --> Tidy, the efficient way (but not allowed for this assignment):
# table2_transpose = table2.T
# table2_transpose = table2_transpose.reset_index()
# table2_tidy = table2_transpose.melt(id_vars='index', 
#                           value_vars=['treatmenta', 'treatmentb'])
# table2_tidy = table2_tidy.rename(columns={'index': 'name', 
#                             'variable': 'treatment', 
#                             'value': 'result'})
# table2_tidy['treatment'] = table2_tidy['treatment'].str.replace('treatment', '')
# table2_tidy

In [60]:
# # Alternate version without using .T function to transpose (handwritten transpose):
table2_transpose = pd.DataFrame([table2['John Smith'], 
                                 table2['Jane Doe'], 
                                 table2['Mary Johnson']], 
                                index=table2.columns.tolist(), 
                                columns=table2.index.tolist())
table2_transpose = table2_transpose.reset_index()
table2_transpose
table2_tidy = table2_transpose.melt(id_vars='index', 
                          value_vars=['treatmenta', 'treatmentb'])
table2_tidy = table2_tidy.rename(columns={'index': 'name', 
                            'variable': 'treatment', 
                            'value': 'result'})
table2_tidy['treatment'] = table2_tidy['treatment'].str.replace('treatment', '')
table2_tidy

           name treatment  result
0    John Smith         a     NaN
1      Jane Doe         a    16.0
2  Mary Johnson         a     3.0
3    John Smith         b     2.0
4      Jane Doe         b    11.0
5  Mary Johnson         b     1.0

In [61]:
tidy

           name treatment  result
0    John Smith         a     NaN
1      Jane Doe         a    16.0
2  Mary Johnson         a     3.0
3    John Smith         b     2.0
4      Jane Doe         b    11.0
5  Mary Johnson         b     1.0

In [62]:
# Tidy --> Table 2:
tidy['treatment'] = tidy['treatment'].str.replace('a', 'treatmenta')
tidy['treatment'] = tidy['treatment'].str.replace('b', 'treatmentb')
tidy_to_table2 = pd.pivot_table(tidy, 
                                values=['result'], 
                                index=['treatment'], 
                                columns=['name'])
tidy_to_table2

             result
name       Jane Doe John Smith Mary Johnson
treatment
treatmenta     16.0        NaN          3.0
treatmentb     11.0        2.0          1.0

In [63]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

**Part 2:**
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
flights = sns.load_dataset('flights')

In [68]:
type(flights)

pandas.core.frame.DataFrame

In [71]:
# Make a pivot table of the dataframe, showing passengers in year vs. month:
passengers_pivot_table = pd.pivot_table(data=flights, values=['passengers'], index=['year'], columns=['month'])
passengers_pivot_table

      passengers                       ...
month    January February March April  ... September October November December
year                                   ...
1949         112      118   132   129  ...       136     119      104      118
1950         115      126   141   135  ...       158     133      114      140
1951         145      150   178   163  ...       184     162      146      166
1952         171      180   193   181  ...       209     191      172      194
1953         196      196   236   235  ...       237     211      180      201
1954         204      188   235   227  ...       259     229      203      229
1955         242      233   267   269  ...       312     274      237      278
1956         284      277   317   313  ...       355     306      271      306
1957         315      301   356   348  ...       404     347      305      336
1958         340      318   362   348  ...       404     359      310      337
1959         360      342   406   396  ...       463     407      362      405
1960         417      391   419   461  ...       508     461      390      432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
# Want to do this this weekend!  Need to review some of the extra materials first.

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
# Want to do this this weekend!  Need to review some of the extra materials first.